In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
ltcameroon = pd.read_csv("data/ltcountry/ltcameroon.csv")
ltpoland = pd.read_csv("data/ltcountry/ltpoland.csv")

In [3]:
ltcameroon.shape

(48, 11)

In [4]:
ltpoland.shape

(120, 11)

In [5]:
ltpoland.head()

,locationid,year,month,temperature,latitude,longitude,elevation,station,countryid,country,latabs
0,PL000012120,2019,1,0.55,54.750,17.5331,2.0,LEBA,PL,Poland,54.750
1,PL000012385,2019,1,-2.73,52.250,22.2500,152.0,SIEDLCE,PL,Poland,52.250
2,PLM00012160,2019,1,-2.14,54.167,19.4330,43.0,ELBLAG_MILEJEWO,PL,Poland,54.167
3,PLM00012205,2019,1,1.25,53.400,14.6170,7.0,SZCZECIN,PL,Poland,53.400
4,PLM00012295,2019,1,-3.85,53.100,23.1670,151.0,BIALYSTOK,PL,Poland,53.100

In [6]:
ltall = pd.concat([ltcameroon, ltpoland])
ltall.country.value_counts()

Poland      120
Cameroon     48
Name: country, dtype: int64

In [7]:
>>> directory = "data/ltcountry"
>>> ltall = pd.DataFrame()
>>> 
>>> for filename in os.listdir(directory):
...   if filename.endswith(".csv"): 
...     fileloc = os.path.join(directory, filename)
...     # open the next file
...     with open(fileloc) as f:
...       ltnew = pd.read_csv(fileloc)
...       print(filename + " has " + str(ltnew.shape[0]) + " rows.")
...       ltall = pd.concat([ltall, ltnew])
...       # check for differences in columns
...       columndiff = ltall.columns.symmetric_difference(ltnew.columns)
...       if (not columndiff.empty):
...         print("", "Different column names for:", filename,\
...           columndiff, "", sep="\n")

ltbrazil.csv has 1104 rows.
ltcameroon.csv has 48 rows.
ltindia.csv has 1056 rows.
ltjapan.csv has 1800 rows.
ltmexico.csv has 852 rows.
ltoman.csv has 288 rows.

Different column names for:
ltoman.csv
Index(['latabs'], dtype='object')

ltpoland.csv has 120 rows.

In [8]:
ltall[['country','station','month','temperature','latitude']].sample(5, random_state=1)

     country                     station  month  temperature  latitude
717   Brazil                  TAGUATINGA      8        27.75   -12.400
649    Japan                   MATSUMOTO      5        17.25    36.250
172     Oman                 BURAIMI_AUT      8        37.40    24.233
1029   India             JAIPUR_SANGANER     12        14.92    26.817
351   Mexico  SN_CRISTOBAL_LAS_CASASCHIS      5        19.30    16.750

In [9]:
ltall.country.value_counts().sort_index()

Brazil      1104
Cameroon      48
India       1056
Japan       1800
Mexico       852
Oman         288
Poland       120
Name: country, dtype: int64

In [11]:
ltall.groupby(['country']).agg({'temperature':['min','mean', 'max','count'],'latabs':['min','mean','max','count']})

         temperature                          latabs
                 min       mean    max count     min       mean     max count
country
Brazil         12.20  25.470196  33.93   969   0.051  13.859272  33.517  1104
Cameroon       21.87  27.227941  36.00    34   4.020   7.789250  10.451    48
India           1.95  26.113477  37.40  1044   8.300  21.104516  34.083  1056
Japan          -7.15  15.495854  30.14  1797  24.300  35.664822  45.417  1800
Mexico          7.00  23.230397  34.45   806  14.917  22.114901  32.400   852
Oman           12.10  27.753463  38.39   205     NaN        NaN     NaN     0
Poland         -3.85  10.462750  23.25   120  50.078  52.498500  54.750   120

In [12]:
ltall['latabs'] = np.where(ltall.country=="Oman", ltall.latitude, ltall.latabs)
ltall.groupby(['country']).agg({'temperature':['min','mean',\
  'max','count'],'latabs':['min','mean','max','count']})

         temperature                          latabs
                 min       mean    max count     min       mean     max count
country
Brazil         12.20  25.470196  33.93   969   0.051  13.859272  33.517  1104
Cameroon       21.87  27.227941  36.00    34   4.020   7.789250  10.451    48
India           1.95  26.113477  37.40  1044   8.300  21.104516  34.083  1056
Japan          -7.15  15.495854  30.14  1797  24.300  35.664822  45.417  1800
Mexico          7.00  23.230397  34.45   806  14.917  22.114901  32.400   852
Oman           12.10  27.753463  38.39   205  16.933  21.997875  26.167   288
Poland         -3.85  10.462750  23.25   120  50.078  52.498500  54.750   120

In [14]:
>>> import pandas as pd
>>> nls97weeksworked = pd.read_csv("data/nls97weeksworked.csv")
>>> nls97colenr = pd.read_csv("data/nls97colenr.csv")

In [15]:
nls97weeksworked.sample(10, random_state=1)

       originalid  year  weeksworked
32923        7199  2003            0
14214        4930  2001           52
2863         4727  2000           13
9746         6502  2001            0
2479         4036  2000           28
39435        1247  2004           52
36416        3481  2004           52
6145         8892  2000           19
5348         8411  2000            0
24193        4371  2002           34

In [16]:
nls97colenr.sample(10, random_state=1)

       originalid  year              colenr
32923        7199  2003     1. Not enrolled
14214        4930  2001     1. Not enrolled
2863         4727  2000                 NaN
9746         6502  2001     1. Not enrolled
2479         4036  2000     1. Not enrolled
39435        1247  2004   3. 4-year college
36416        3481  2004     1. Not enrolled
6145         8892  2000     1. Not enrolled
5348         8411  2000     1. Not enrolled
24193        4371  2002  2. 2-year college

In [17]:
nls97colenr.shape

(44920, 3)

In [19]:
nls97colenr.originalid.nunique()

8984

In [20]:
nls97weeksworked.groupby(['originalid','year'])\
...   ['originalid'].count().shape

(44920,)

In [21]:
nls97colenr.groupby(['originalid','year'])\
...   ['originalid'].count().shape

(44920,)

In [22]:
>>> def checkmerge(dfleft, dfright, idvar):
...   dfleft['inleft'] = "Y"
...   dfright['inright'] = "Y"
...   dfboth = pd.merge(dfleft[idvar + ['inleft']],\
...     dfright[idvar + ['inright']], on=idvar, how="outer")
...   dfboth.fillna('N', inplace=True)
...   print(pd.crosstab(dfboth.inleft, dfboth.inright))

In [23]:
checkmerge(nls97weeksworked.copy(),nls97colenr.copy(), ['originalid','year'])

inright      Y
inleft
Y        44920